Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: ClipData := FileRead("Company Logo.clip", "RAW") ; In this case, FileRead returns a Buffer.
ja: ClipData := FileRead("Company Logo.clip", "RAW") ; この場合、FileReadはBufferを返します。

source: ClipSaved := "" ; Free the memory in case the clipboard was very large.
ja: ClipSaved := "" ; クリップボードが非常に大きい場合に備えて、メモリを解放しています。

source: ClipSaved := ClipboardAll() ; Save the entire clipboard to a variable of your choice.
ja: ClipSaved := ClipboardAll() ; クリップボード全体を任意の変数に保存します。

source: ClipWait - Syntax & Usage | AutoHotkey v2
ja: ClipWait - 構文と使用法｜AutoHotkey v2

source: Clipboard utilities written in AutoHotkey v1:
ja: AutoHotkey v1 で書かれたクリップボードユーティリティです：

source: ClipboardAll (replaced with the ClipboardAll function)
ja: ClipboardAll（ClipboardAll関数に置き換えます）

source: ClipboardAll - Syntax & Usage | AutoHotkey v2
ja: ClipboardAll - 構文と使用法｜AutoHotkey v2

source: Clips child windows relative to each other; that is, when a particular child window receives a WM_PAINT message, the WS_CLIPSIBLINGS style clips all other overlapping child windows out of the region of the child window to be updated.
ja: つまり、特定の子ウィンドウが WM_PAINT メッセージを受信すると、WS_CLIPSIBLINGS スタイルは、更新される子ウィンドウの領域から、重なっている他のすべての子ウィンドウをクリップします。

source: Cloaked windows are also considered hidden.
ja: また、クロークドウィンドウも隠し味として扱われます。

source: Cloaked windows, introduced with Windows 8, are windows on a non-active virtual desktop or UWP apps which have been suspended to improve performance, or more precisely to reduce their memory consumption.
ja: Windows 8から導入されたクロークドウィンドウは、非アクティブな仮想デスクトップ上のウィンドウや、パフォーマンス向上、より正確にはメモリ消費を抑えるために中断されたUWPアプリのことです。

source: Cloning an object preserves binary data in strings, up to the stored length of the string (not its capacity).
ja: オブジェクトのクローンは、文字列のバイナリデータを、保存された文字列の長さまで保存します（容量ではありません）。

source: Close the Alt-tab menu.
ja: Alt-tabメニューを閉じる。

source: Closes either Notepad or another window, depending on which of them was found by the WinActive functions above.
ja: 上記のWinActive関数によって見つかったメモ帳または別のウィンドウを閉じる。

source: Closes the active window activated by GroupActivate or GroupDeactivate and activates the newest window (the one most recently active) in a window group.
ja: GroupActivateまたはGroupDeactivateでアクティブになったウィンドウを閉じ、ウィンドウグループの中で最も新しいウィンドウ（最も最近アクティブになったウィンドウ）をアクティブにします。

source: Closes the active window if it was just activated by GroupActivate or GroupDeactivate.
ja: GroupActivate関数またはGroupDeactivate関数によってアクティブになったウィンドウを閉じます。

source: Closes the file, flushes any data in the cache to disk and releases the share locks.
ja: ファイルを閉じ、キャッシュ内のデータをディスクにフラッシュし、共有ロックを解除します。

source: Closes the specified window.
ja: 指定したウィンドウを閉じます。

source: Closes unwanted windows whenever they appear.
ja: 不要なウィンドウが表示されたら、その都度閉じる。

source: Closing this window with WinClose (even from another script) causes the script to exit, but most other methods just hide the window and leave the script running.
ja: WinCloseでこのウィンドウを閉じると（他のスクリプトからでも）スクリプトが終了しますが、他のほとんどの方法ではウィンドウが非表示になるだけで、スクリプトは実行されたままになります。

source: Closures
ja: クロージャ

source: Closures allow one or more nested functions to share variables with the outer function even after the outer function returns.
ja: クロージャは、1つまたは複数のネストした関数が、外側の関数が戻った後でも、外側の関数と変数を共有することを可能にします。

source: Closures may also be used with built-in functions, such as SetTimer or Hotkey.
ja: クロージャは、SetTimerやHotkeyなどの組み込み関数で使用することもできます。

source: Code blocks
ja: コードブロック

source: Code folding
ja: コード・フォールディング

source: Code for dealing with paths within the program may rely on the first limitation to simplify the code, effectively placing another 259 character limitation.
ja: プログラム内でパスを扱うコードは、コードを単純化するために最初の制限に依存する可能性があり、事実上、別の259文字の制限を置くことになる。

source: Code for v1.0 which uses these characters in a variable name would have a new interpretation in v1.1, and as such might not be detected as an error.
ja: これらの文字を変数名に使用したv1.0のコードは、v1.1では新しい解釈を持つことになり、エラーとして検出されない可能性があります。

source: Code to be executed at startup (immediately when the script starts) is often placed at the top of the file.
ja: 起動時（スクリプトを起動した直後）に実行されるコードは、ファイルの先頭に配置されることが多い。

source: Collapsed
ja: 折りたたんだ状態

source: Collapses the specified window into a button on the task bar.
ja: 指定されたウィンドウをタスクバーのボタンに折りたたみます。

source: Collects the values from named controls and composes them into an Object.
ja: 名前付きコントロールから値を収集し、オブジェクトに合成します。

source: Colon ':' is allowed only if Function is specified, and is optional if Number is omitted.
ja: コロン「:」は、Functionが指定されている場合のみ許可され、Numberが省略されている場合はオプションである。

source: Color IDs can be determined using Window Spy (accessible from the tray menu) or via PixelGetColor.
ja: カラーIDは、Window Spy（トレイメニューからアクセス可能）またはPixelGetColorを使用して決定することができます。

source: Color name (see color chart) or RGB value -- or specify the word Default to return to the system's default color (black on most systems).
ja: 色名（カラーチャート参照）またはRGB値 -- あるいはDefaultを指定すると、システムのデフォルトカラー（ほとんどのシステムでは黒）に戻ります。

source: Color of text (has no effect on buttons).
ja: テキストの色（ボタンには影響しません）。

source: Color theme:
ja: カラーテーマ：

source: Colors might turn out black (0x000000) no matter the color you try to get.
ja: どんな色を出そうとしても黒（0x000000）になるかもしれない。

source: Column headers do not work like buttons.
ja: カラムヘッダーはボタンのようには機能しない。

source: Column numbers seen by the script are not altered by any dragging and dropping of columns the user may have done.
ja: スクリプトが見る列番号は、ユーザーが行った列のドラッグ＆ドロップによって変更されることはありません。

source: ComCall - Syntax & Usage | AutoHotkey v2
ja: ComCall - 構文と使用法｜AutoHotkey v2

source: ComObjActive - Syntax & Usage | AutoHotkey v2
ja: ComObjActive - 構文と使用法｜AutoHotkey v2

source: ComObjArray - Syntax & Usage | AutoHotkey v2
ja: ComObjArray - 構文と使用法｜AutoHotkey v2

source: ComObjArray objects may also be returned by COM methods and ComValue.
ja: ComObjArrayオブジェクトは、COMメソッドやComValueによって返されることもある。

source: ComObjArray objects support the following methods:
ja: ComObjArray オブジェクトは、以下のメソッドをサポートしています：

source: ComObjConnect - Syntax & Usage | AutoHotkey v2
ja: ComObjConnect - 構文と使用法｜AutoHotkey v2

source: ComObjConnect(WB, WB_events) ; Connect WB's events to the WB_events class object.
ja: ComObjConnect(WB, WB_events) ; WBのイベントをWB_eventsクラスオブジェクトに接続します。

source: ComObjCreate() → ComObject, which is a class now
ja: ComObjCreate() → ComObjectであり、今はクラスになっています

source: ComObjEnwrap() (use ComObjFromPtr instead, and ObjAddRef if needed)
ja: ComObjEnwrap()（代わりにComObjFromPtrを使用し、必要に応じてObjAddRefを使用）

source: ComObjFlags - Syntax & Usage | AutoHotkey v2
ja: ComObjFlags - 構文と使用法｜AutoHotkey v2

source: ComObjFlags(arr2, -1) ; Remove F_OWNVALUE.
ja: ComObjFlags(arr2, -1) ; F_OWNVALUEを削除します。

source: ComObjFromPtr - Syntax & Usage | AutoHotkey v2
ja: ComObjFromPtr - 構文と使用法｜AutoHotkey v2

source: ComObjGet - Syntax & Usage | AutoHotkey v2
ja: ComObjGet - 構文と使用法｜AutoHotkey v2

source: ComObjMissing() (write two consecutive commas instead)
ja: ComObjMissing()（代わりに2つの連続したカンマを書きます）

source: ComObjParameter() → ComValue, which is a class now
ja: ComObjParameter() → ComValueであり、現在はクラスになっています

source: ComObjQuery - Syntax & Usage | AutoHotkey v2
ja: ComObjQuery - 構文と使用法｜AutoHotkey v2

source: ComObjQuery permits the first parameter to be any object with a Ptr property.
ja: ComObjQueryでは、第1パラメータにPtrプロパティを持つ任意のオブジェクトを指定することができます。

source: ComObjType - Syntax & Usage | AutoHotkey v2
ja: ComObjType - 構文と使用法｜AutoHotkey v2

source: ComObjUnwrap() (use ComObjValue instead, and ObjAddRef if needed)
ja: ComObjUnwrap()（代わりにComObjValueを使用し、必要に応じてObjAddRefを使用）

source: ComObjValue - Syntax & Usage | AutoHotkey v2
ja: ComObjValue - 構文と使用法｜AutoHotkey v2

source: ComObjXXX() where XXX is anything other than one of the explicitly defined ComObj functions (use ComObjActive, ComValue or ComObjFromPtr instead).
ja: ComObjXXX() ここで、XXXは明示的に定義されたComObj関数以外のものです（代わりにComObjActive、ComValue、ComObjFromPtrを使用してください）。

source: ComObject - Syntax & Usage | AutoHotkey v2
ja: ComObject - 構文と使用法｜AutoHotkey v2

source: ComObject typically represents a COM or "Automation" object implementing the IDispatch interface, but is also used to wrap values of specific types to be passed to COM objects and functions.
ja: ComObjectは通常、IDispatchインターフェイスを実装したCOMまたは「オートメーション」オブジェクトを表しますが、COMオブジェクトや関数に渡される特定の型の値をラップするためにも使用されます。

source: ComSpec (use A_ComSpec)
ja: ComSpec（A_ComSpecを使用します）

source: ComValue - Syntax & Usage | AutoHotkey v2
ja: ComValue - 構文と使用法｜AutoHotkey v2

source: ComValue, ComValueRef, ComObjArray or ComObject
ja: ComValue, ComValueRef, ComObjArray または ComObject

source: Combinations of three or more keys are not supported.
ja: 3つ以上のキーの組み合わせはサポートされていません。

source: Combinations which your keyboard hardware supports can usually be detected by using #HotIf and GetKeyState, but the results may be inconsistent.
ja: キーボードのハードウェアがサポートする組み合わせは、通常#HotIfと GetKeyStateを使用して検出することができますが、結果は一貫していない場合があります。

source: ComboBox: Either CBS_DROPDOWN or CBS_SIMPLE
ja: ComboBox：CBS_DROPDOWNまたはCBS_SIMPLEのいずれか

source: Come back to Winspector Spy and press the traffic light button to pause monitoring.
ja: ウィンスペクター・スパイに戻り、信号ボタンを押して監視を一時停止する。

source: Comma is also used to delimit the parameters of a function call or control flow statement.
ja: カンマは、関数呼び出しや制御フロー文のパラメータを区切るためにも使われる。

source: Command
ja: コマンド

source: Command (should already be filled in):
ja: コマンド（すでに記入されているはずです。）

source: Command (should already be filled in): cmd.exe (or the full path to it)
ja: コマンド（すでに記入されているはずです）：cmd.exe（またはそのフルパス）

source: Command Line
ja: コマンドライン

source: Command Line Usage
ja: コマンドラインの使用法

source: Command had no effect.
ja: コマンドは何の効果もありませんでした。

source: Command-line Client
ja: コマンドラインクライアント

source: Command-line Parameters
ja: コマンドラインパラメーター

source: Command-line args are no longer stored in a pseudo-array of numbered global vars; the global variable A_Args (added in v1.1.27) should be used instead.
ja: コマンドラインの引数は、番号付きグローバル変数の擬似配列に格納されなくなりました。代わりにグローバル変数A_Args（v1.1.27で追加）を使用する必要があります。

source: Commands such as "Process Exist" which used it to return a value now simply return that value (e.g. pid := ProcessExist()) or something more useful (e.g. hwnd := GroupActivate(group)).
ja: 「Process Exist」などのコマンドで値を返していたものが、単にその値を返す（例：pid := ProcessExist()）か、もっと便利なもの（例：hwnd := GroupActivate(group)）になりました。

source: Commas always need to be escaped, regardless of the parameter position.
ja: カンマは、パラメータの位置に関係なく、常にエスケープする必要がある。

source: Commas may be used to write multiple sub-expressions on a single line.
ja: カンマは、1行に複数の部分式を記述するために使用することができる。

source: Comments
ja: コメント

source: Comments and empty lines are omitted.
ja: コメントや空行は省略されます。

source: Comments can be written to the file but are stripped out when they are read back by IniRead.
ja: コメントはファイルに書き込むことができますが、IniReadで読み返す際には取り除かれます。

source: Comments may also be added at the end of a line, in which case the semicolon must have at least one space or tab to its left.
ja: コメントは行末に追加することもできますが、その場合、セミコロンの左側には少なくとも1つのスペースまたはタブが必要です。

source: Comments that describe the shortcut (used by the OS to display a tooltip, etc.)
ja: ショートカットを説明するコメント（OSがツールチップを表示するときなどに使用します）

source: Common Styles
ja: 一般的なスタイル

source: Common Styles and Other Options
ja: 一般的なスタイルとその他のオプション

source: Common Tasks
ja: 一般的な事項

source: Common abbreviations include param and arg.
ja: 一般的な略語として、param、argがあります。

source: Common character codes include 9 (tab), 10 (linefeed), 13 (carriage return), 32 (space), 48-57 (the digits 0-9), 65-90 (uppercase A-Z), and 97-122 (lowercase a-z).
ja: 一般的な文字コードは、9（タブ）、10（ラインフィード）、13（キャリッジリターン）、32（スペース）、48～57（0～9の数字）、65～90（大文字A～Z）、97～122（小文字a～z）です。

source: Common directives such as #NoEnv and #If (v1) or #HotIf (v2).
ja: NoEnvや#If（v1）、#HotIf（v2）などの一般的なディレクティブ。

source: Common monospaced (fixed-width) fonts in this table are Cascadia Mono, Consolas, Courier, Courier New, Fixedsys, Lucida Console, and Terminal.
ja: この表にある一般的な等幅（固定幅）フォントは、Cascadia Mono、Consolas、Courier、Courier New、Fixedsys、Lucida Console、および Terminal です。

source: Common monospaced (fixed-width) fonts in this table are Consolas, Courier, Courier New, Fixedsys, Lucida Console and Terminal.
ja: この表の一般的な等幅（固定幅）フォントは、Consolas、Courier、Courier New、Fixedsys、Lucida Console、Terminalです。

source: Common sources of text data:
ja: テキストデータの一般的なソース：

source: Common sources of text data: FileRead, Download, A_Clipboard, GUI Edit controls
ja: テキストデータの一般的なソース：FileRead、Download、A_Clipboard、GUI Edit コントロール

source: Common usage of an Else statement.
ja: Else文の一般的な使い方。

source: Common web browsers may show a warning like "AutoHotkey_2.0_setup.exe was blocked because it could harm your device." This is a generic warning that applies to any executable file type that isn't "commonly downloaded".
ja: 一般的なWebブラウザでは、「AutoHotkey_2.0_setup.exe was blocked because it could harm your device.」のような警告が表示される場合があります。これは、「一般的にダウンロードされている」ものではない実行ファイルタイプに適用される一般的な警告です。

source: Common workarounds are as follows:
ja: 一般的な回避策は以下の通りです：

source: Commonly Used
ja: 一般的に使用される

source: Commonly Used Symbols and Syntax
ja: よく使われる記号と構文

source: Commonly used notification codes are translated to events, which the script can monitor with OnEvent.
ja: 一般的に使用される通知コードはイベントに変換され、スクリプトはOnEventで監視することができます。

source: Compare this to the equivalent ComCall example.
ja: 同等のComCallの例と比較してみてください。

source: Compare this to the equivalent DllCall example.
ja: 同等のDllCallの例と比較してみてください。

source: Compares two date-time values and returns the difference.
ja: 2つの日付時刻の値を比較し、その差を返します。

source: Compares two strings alphabetically.
ja: 2つの文字列をアルファベット順に比較します。

source: Compares two version strings.
ja: 2つのバージョンの文字列を比較します。

source: Comparison of string keys is case-sensitive, while objects are compared by reference/address.
ja: 文字列キーの比較は大文字と小文字を区別し、オブジェクトの比較は参照/アドレスで行います。

source: Comparisons and assignments such as obj1 == obj2 and arr[obj1] := value treat the two wrapper objects as unique, even when they contain the same COM object.
ja: obj1 == obj2のような比較やarr[obj1] := valueのような代入では、同じCOMオブジェクトが含まれている場合でも2つのラッパーオブジェクトが一つのものとして扱われます。

source: Comparisons and assignments such as obj1 == obj2 and arr[obj1] := value treat the two wrapper objects as unique, even when they contain the same variant type and value.
ja: obj1 == obj2やarr[obj1] := valueのような比較や代入は、同じバリアント型や値を含んでいても、2つのラッパーオブジェクトをユニークなものとして扱います。

source: Comparisons and assignments such as obj1 == obj2 and array[obj1] := value treat the two wrapper objects as unique, even when they contain the same COM object.
ja: obj1 == obj2やarray[obj1] := valueのような比較や代入は、同じ COM オブジェクトを含んでいても、2 つのラッパーオブジェクトはユニークなものとして扱われます。

source: Comparisons and assignments such as obj1 == obj2 and array[obj1] := value treat the two wrapper objects as unique, even when they contain the same variant type and value.
ja: obj1 == obj2やarray[obj1] := valueのような比較や代入は、同じバリアント型や値を含んでいても、2つのラッパーオブジェクトをユニークなものとして扱います。

source: Compile script (if Ahk2Exe is installed)
ja: コンパイルスクリプト（Ahk2Exeがインストールされている場合）

source: Compile: Opens Ahk2Exe, or offers to automatically download and install it.
ja: Compile：Ahk2Exeを開くか、自動的にダウンロードしてインストールします。

source: Compiled Scripts
ja: コンパイル済みスクリプト

source: Compiled scripts include only the last three by default.
ja: コンパイルされたスクリプトには、デフォルトで最後の3つだけが含まれています。

source: Compiler Topics
ja: コンパイラ・トピックス

source: Compiling does not typically improve the performance of a script.
ja: 通常、コンパイルによってスクリプトのパフォーマンスが向上することはない。

source: Component doesn't support this control type
ja: コンポーネントがこのコントロールタイプをサポートしていない

source: Component not found
ja: コンポーネントが見つかりません

source: Components
ja: コンポーネント

source: Components are as shown on the Levels tab of the sound device's properties dialog.
ja: コンポーネントは、サウンドデバイスのプロパティダイアログのLevelsタブに表示されている通りです。

source: Components are discovered through the DeviceTopology API, which exposes a graph of Connectors and Subunits.
ja: コンポーネントは、コネクターと サブユニットのグラフを公開するDeviceTopology APIを通じて発見される。

source: Compressing Compiled Scripts
ja: コンパイル済みスクリプトの圧縮

source: Concatenating an object with another value or passing it to Loop is currently treated as an error, whereas previously the object was treated as an empty string.
ja: オブジェクトを他の値と連結したり、Loopに渡すと、以前は空文字列として扱われていましたが、現在はエラーとして扱われます。

source: Concatenation of two strings where one or both contain binary zero no longer causes truncation of the data.
ja: 2つの文字列の一方または両方にバイナリゼロが含まれる場合に、2つの文字列を連結しても、データが切り捨てられることがなくなりました。

source: Concatenation.
ja: 連結。

source: Concepts and Conventions
ja: 概念と慣習

source: Concepts and Conventions | AutoHotkey v2
ja: 概念と慣習｜AutoHotkey v2

source: Configure the DBGp plugin via Plugins, DBGp, Config...
ja: DBGpプラグインの設定は、「プラグイン」→「DBGp」→「設定...」で行います

source: Configure the launcher.
ja: ランチャーを設定する。

source: Connect to a debugging client.
ja: デバッグ・クライアントに接続する。

source: Connects a COM object's event source to the script, enabling events to be handled.
ja: COMオブジェクトのイベントソースをスクリプトに接続し、イベントを処理できるようにします。

source: Consecutive Text or Link controls are given additional vertical padding, so that they typically align better in cases where a column of Edit, DDL or similar-sized controls are later added to their right.
ja: 連続するテキストコントロールやリンクコントロールには垂直方向のパディングが追加され、編集、DDL、または同様のサイズのコントロールの列がその右に追加された場合に、通常より整列するようになります。

source: Consecutive unary operators such as !!Var are allowed because they are evaluated in right-to-left order.
ja: !!Varのような連続する単項演算子は、右から左の順番で評価されるため許される。

source: Consequently there is no need to do Critical "Off" right before ending a thread.
ja: そのため、スレッドを終了する直前にCritical "Off"を行う必要はありません。

source: Consequently, ? (used in ternary operations) no longer requires a space on either side.
ja: その結果、（3項演算で使用される）?は、両脇にスペースを必要としなくなった。

source: Consequently, str needs to be converted every time it is used as a number (instead of just the first time), unless it was originally assigned a pure number.
ja: そのため、strはもともと純粋な数字が割り当てられている場合を除き、数字として使われるたびに（初回だけでなく）変換する必要があります。

source: Consequently, SendPlay does not trigger hotkeys or hotstrings.
ja: その結果、SendPlayはホットキーやホットストリングをトリガーしません。

source: Consequently, a line such as Var1 := Var2 := 0 first assigns 0 to Var2 then assigns Var2 to Var1.
ja: その結果、Var1 := Var2 := 0のような行は、まずVar2に0を代入し、次にVar2をVar1に代入する。

source: Consequently, a local variable may have the same name as a global variable but have separate contents.
ja: その結果、ローカル変数はグローバル変数と同じ名前を持ちながら、別々の内容を持つことがあります。

source: Consequently, any press-duration a script puts into effect during script startup will apply to all such remappings.
ja: その結果、スクリプトの起動時にスクリプトが有効にするプレスデュレーションは、そのような再マッピングすべてに適用される。

source: Consequently, any trailing slash in a quoted parameter (such as "C:\My Documents\") is treated as a literal quotation mark (that is, the script would receive the string C:\My Documents").
ja: その結果、引用符で囲まれたパラメータ（"C:\My Documents\"など）の末尾のスラッシュは、リテラル引用符として扱われます（つまり、スクリプトは "C:\My Documents"という文字列を受け取ります）。

source: Consequently, both January 4th and the first Thursday of January are always in week 1.
ja: その結果、1月4日と1月第1木曜日は、いずれも必ず第1週になります。

source: Consequently, calling LV.DeleteCol(2) twice would delete the second and third columns.
ja: その結果、LV.DeleteCol(2)を2回呼び出すと、2列目と3列目が削除されます。

source: Consequently, it generally cannot merge two isolated scripts together into one functioning script.
ja: そのため、一般的に、孤立した2つのスクリプトを1つの機能するスクリプトに統合することはできません。

source: Consequently, it is no longer necessary to retain a reference to an ActiveX object for the purpose of keeping a ComObjConnect connection alive.
ja: その結果、ComObjConnectの接続を維持するためにActiveXオブジェクトへの参照を保持する必要がなくなりました。

source: Consequently, literal strings must be enclosed in double quotes to distinguish them from variables.
ja: したがって、リテラル文字列は変数と区別するために二重引用符で囲む必要があります。

source: Consequently, no messages are monitored or buffered when the current thread's priority is higher than 0.
ja: その結果、現在のスレッドの優先順位が0より高い場合、メッセージの監視やバッファリングは行われない。

source: Consequently, the fast mode should be used only when it is known exactly which thread(s) the function will be called from.
ja: したがって、高速モードは、その関数がどのスレッドから呼び出されるかが正確に分かっている場合にのみ使用する必要があります。

source: Consequently, the interpretation of else may differ from previous versions when used without braces.
ja: そのため、elseを中括弧なしで使用する場合、以前のバージョンと解釈が異なる場合があります。

source: Consequently, the interpretation of Else may differ from previous versions when used without braces.
ja: そのため、Elseを中括弧なしで使用する場合、以前のバージョンと解釈が異なる場合があります。

source: Consider installing an editor with AutoHotkey support to make editing and testing scripts much easier.
ja: スクリプトの編集やテストをより簡単にするために、AutoHotkeyをサポートするエディターのインストールを検討してください。

source: Consider the following example, which makes Numpad0 into a prefix key:
ja: Numpad0をプレフィックスキーにする、次の例を考えてみましょう：

source: Consider the following example:
ja: 次のような例を考えてみましょう：

source: Consider the following simple function that accepts two numbers and returns their sum:
ja: 2つの数値を受け取り、その和を返す次のような単純な関数を考えてみましょう：

source: Consider this example, which recognizes Ctrl+C:
ja: Ctrl+Cを認識するこの例について考えてみましょう：

source: Consider this example, which uses the string <br> as a delimiter:
ja: 文字列<br> をデリミタとして使用する例を考えてみましょう：

source: Consider this revised set of instructions:
ja: この改訂版の検討：

source: Consider using Else, Blocks, Break, and Continue as substitutes for Goto.
ja: Gotoの代用としてElse、Blocks、Break、Continueの使用を検討します。

source: Constant
ja: 定数

source: Constants
ja: 定数

source: Construction and Destruction
ja: コンストラクタとデストラクタ

source: Constructs a new Gui instance.
ja: 新しいGuiインスタンスを構築します。

source: Constructs a new instance of the class.
ja: このクラスの新しいインスタンスを構築します。

source: Contain 1 and 0.
ja: 0と1です。

source: Contains 0 if Critical is off for the current thread.
ja: 現在のスレッドでCriticalがオフの場合は0が格納される。

source: Contains 1 (true) if the OS is 64-bit or 0 (false) if it is 32-bit.
ja: OSが64ビットの場合は1 (true)、32ビットの場合は0 (false)を含む。

source: Contains 1 if the thread immediately underneath the current thread is paused.
ja: 現在のスレッドの直下のスレッドが 一時停止している場合は1が格納される。

source: Contains 1 if the script is suspended and 0 otherwise.
ja: スクリプトが中断されている場合は1を、そうでない場合は0を含む。

source: Contains 1 if the script is running as a compiled EXE and an empty string (which is considered false) if it is not.
ja: スクリプトがコンパイルされたEXEとして実行されている場合は1が、そうでない場合は空文字列(falseとみなされる)が格納される。

source: Contains a single space character.
ja: スペース1文字を含む。

source: Contains a single tab character.
ja: タブ文字を1文字含む。

source: Contains additional information about the following events:
ja: 以下のイベントに関する追加情報が含まれています：

source: Contains an array of command line parameters.
ja: コマンドラインパラメータの配列を含む。

source: Contains the same string as the environment's ComSpec variable.
ja: 環境のComSpec変数と同じ文字列。

source: Contains the size of a pointer, in bytes.
ja: ポインタのサイズをバイト数で表す。

source: Contains the version of AutoHotkey that is running the script, such as 1.0.22.
ja: 1.0.22のように、スクリプトを実行しているAutoHotkeyのバージョンが含まれています。

source: Contains zero or more options from the list below (not case-sensitive).
ja: 以下のリストから0個以上のオプションを含む（大文字小文字は区別しない）。

source: Content (default)
ja: 目次（初期値）

source: Content font size:
ja: コンテンツのフォントサイズ：

source: Contents := "" ; Free the memory.
ja: Contents := "" ; メモリを解放します。

source: Context Sensitive Help in Any Editor
ja: 如何なるエディタでも文脈依存ヘルプ

source: Context-insensitive Hotkey.
ja: 文脈依存のホットキー。

source: Context-sensitive Controller Buttons
ja: 状況に応じたコントローラーボタン

source: Context-sensitive Hotkeys
ja: 文脈依存のホットキー

source: Context-sensitive Hotstrings
ja: 文脈依存型ホットストリング

source: ContextClearRows(*) ; The user selected "Clear" in the context menu.
ja: ContextClearRows(*) ; ユーザーがコンテキストメニューで「Clear」を選択しました。

source: ContextMenu.Default := "Open" ; Make "Open" a bold font to indicate that double-click does the same thing.
ja: ContextMenu.Default := "Open" ; 「Open」を太字にし、ダブルクリックでも同じことができることを示すようにする。

source: ContextOpenOrProperties(ItemName, *) ; The user selected "Open" or "Properties" in the context menu.
ja: ContextOpenOrProperties(ItemName, *) ; ユーザーがコンテキストメニューの「Open」または「Properties」を選択した。

source: Continuable Errors
ja: 継続可能なエラー

source: Continuation Lines
ja: 継続行

source: Continuation Sections
ja: 継続の部
